# 1. Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# num = input('Введите число: ')
# sum = 0
# for i in num:
#     if i != '.':
#         sum += int(i)
# print(sum)


# 2. Напишите программу, которая принимает на вход число N и выдает набор произведений чисел от 1 до N.

# a = int(input('Введите число: '))
# b = 1
# for i in range(1, a+1):
#     b *= i
#     print(b, end = ', ')



# 3. Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
# Для n = 6: [2, 2, 2, 2, 2, 3] -> 13

# n = int(input('Введите число: '))
# b = 0
# for i in range(1, n+1):
#     sum = round(((1 + 1/i) ** i))
#     b += sum
#     print(round(sum), end = ', ')
# print(b)


# * 4. Напишите программу, которая принимает на вход 2 числа. 
# Задайте список из N элементов, заполненных числами из промежутка [-N, N]. 
# Найдите произведение элементов на указанных позициях(не индексах).
# Position one: 1
# Position two: 3
# Number of elements: 5
# -> [-5, -4, -3, -2, -1, 0, 1, 2, 3, 4, 5]
# -> 15

a = int(input("Введите число: "))
x_1 = int(input("Введите число начала произведения: "))
x_2 = int(input("Введите число окончания произведения: "))
list = []
for i in range(-a, a+1):
    list.append(i)
print(list)

len_list = len(list)
if len_list >= x_1 > 0 and len_list >= x_2 > 0:
    print(list[x_1 - 1] * list[x_2 - 1])

